{
  "type": [
    "h-cite"
  ],
  "properties": {
    "url": [
      "https://colinwalker.blog/2017/10/16/blogging-from-the-mac/"
    ],
    "name": [
      "Blogging from the Mac"
    ],
    "published": [
      "2017-10-16T16:35:18Z"
    ],
    "content": [
      "My phone is really my PC - that’s Primary Computer - and, as I’ve written numerous times, that’s where I do just about everything including 99.9% of my blogging, image manipulations and even coding.\nWhile I have an iPad I almost never use it; the phone is just far more convenient and easier to hold and use in so many more circumstances. People talk about a mobile mindset but, just because I use iOS on a phone it doesn’t automatically mean the same behaviour will occur when using an iPad.\nOr a laptop for that matter.\nI find that I use the MacBook far more than I ever did my Windows laptops but it still feels ridiculously underused. Perhaps that’s about to change.\nI’m writing this in Ulysses, having subscribed to the app and pretty certain I’m going to stick with it, but Manton Reece has just launched a beta Mac client for micro.blog which may well encourage me to use the MacBook more than I ever have.\nI was lucky enough to have an extra day to play with it before launch; I’d expressed an interest in testing and the fact that I’m using WordPress instead of a hosted blog was probably a good opportunity for early feedback.\nManton has repeatedly said that this is just a version 1.0 app but, I have to say, it’s been rock solid. Browsing, replying and posting to the blog have all been a breeze and I’ve not had a single issue or error.\nIt will be nice when some of the additional functionality from the iOS version gets included (such as automatically converting from status to standard post and prompting for a title when you go over 280 characters) but, other than, this is a fully usable and (so far) reliable app which is great to have sat open while doing other things.\nGood job Manton. 👍"
    ],
    "author": [
      "https://colinwalker.blog"
    ]
  }
}