{
  "type": [
    "h-entry"
  ],
  "properties": {
    "content": [
      "*This is an interview I did in 2013 for Hacker Jobs, a website which is sadly no longer available. Here are my Q&A answers.*\r\n\r\n## 1. How important is the choice of languages and platforms to you when it comes to getting a job done well?\r\n\r\nWe use a number of different languages and technologies so it's a case of encouraging our developers to use the best tool for the job. Sometimes a RDBMS like MySQL just isn’t the best way of storing or querying data so we’ll use Redis, statsd, memcached or sphinx.\r\n\r\nI don’t believe in rigidly and dogmatically sticking to one platform, but it’s also important to always be conscious that someone else will need to maintain that system or that bit of code in the future.\r\n\r\n## 2. What is your favourite interview technique and why?\r\n\r\nA conversation. I need to know if a candidate is technically able to do the job, but just as important is deciding whether we would want to sit next to this person every day!\r\n\r\nInterviews can be a nerve-wracking and intimidating experience so it's important to try to have a relaxed chat and draw out the things a candidate is passionate about and wants to share.\r\n\r\n## 3. How important is a Computer Science degree in today’s market?\r\n\r\nMost of our team have at least some flavour of CS degree but it’s not the first thing I look for. If a candidate has the right skills, work ethic and team fit then a strong academic background is secondary.\r\n\r\n## 4. What is one piece of advice you would give to someone applying for a job with your company?\r\n\r\nDo your research on us. Visit our sites and read a few blog posts and tweets. Find out what technologies and languages we use. Decide why you would want to work with us first. We’ll of course answer specific questions in the interview, but I’m amazed at how many candidates apply with only a wafer-thin grasp of who they might be working for and whether we're right for them.\r\n\r\n## 5. How much value do you place in a developer’s personal projects such as GitHub and demo sites when they apply for a job with your company?\r\n\r\nIt’s a definite advantage if I can see code first. We love to see developers who enjoy scratching an itch and want to contribute to open source projects outside work. Also I like to thoroughly research applicants before I interview them. If I can’t find any personal projects on GitHub or blog posts then it makes establishing technical skills a little more difficult. \r\n\r\n## 6. Big Debate: What is the optimal length for a CV?\r\n\r\nI prefer a couple of well-crafted pages: concise content, indented, spaced and spell-checked.\r\n\r\n## 7. What are your thoughts on the Tech Recruitment industry?\r\n\r\nA few white knight recruiters; armies of time-wasting chancers. It’s often a splattergun war of attrition where target-driven recruiters hoover up candidates’ CVs and fire them out in the hope one of them sticks with their clients. Those that try to understand the role and team and only send suitable candidates are worth their weight in gold.\r\n\r\n## 8. In your opinion, what is the difference between a 'Hacker' and a regular programmer?\r\n\r\nWhatever you call yourself I don't like to hear \"programmer\" being used as a pejorative term. The best teams often have a diverse blend of skills, experience and personalities, not just 24/7 hackers. The label, \"rock star\", on the other hand, needs to be put to death.\r\n\r\n## 9. What has been the most exciting technological innovation you've witnessed in the last 12 months?\r\n\r\nIt's not necessarily innovation, but I really love what (Code Club)[http://www.codeclub.org.uk] are doing. It's a not-for-profit that encourages programmers around the UK to volunteer to help teach kids to code in after-school clubs. I can trace my career back to the opportunity I had to learn BASIC on BBC Micros when I was at primary school. It's exciting to think Code Club is sparking a similar interest in thousands of kids today.\r\n\r\n## 10. If you had the opportunity to address the entire Development community in the UK, what would you say?\r\n\r\nStop making sites and apps for you and your friends: everyone can use this stuff now so think beyond the hacker community. Mobile first and touch interfaces first. Don't be a platform zealot. Be friendly, don't hide behind anonymity.\r\n"
    ],
    "category": [
      "interview"
    ],
    "entry-type": [
      "article"
    ],
    "published": [
      "2013-02-27T12:00:00Z"
    ],
    "name": [
      "Hacker Jobs interview"
    ],
    "updated": [
      "2017-10-30T15:44:02Z"
    ]
  }
}
