{
  "type": [
    "h-entry"
  ],
  "properties": {
    "content": [
      "Now that, according to a recent study, [over half of employees work remotely at\r\nleast once per week][owl], remote working is no longer considered an exception.\r\nCompanies that recognise the benefits and work hard to support effective remote\r\nworking are rewarded with happy and productive people.\r\n\r\nThis post describes how we've structured our team and processes in the\r\n[development team][devteam] at [Venntro][]. It follows a chat with our remote\r\nteam (naturally, over [Slack][]) about their experiences working remotely with\r\nus, and I've included their comments.\r\n\r\n## The 100% remote\r\nWe have six people in our development team who are 100% remote: four spread\r\naround the UK and two in New Zealand. Of the six, all but one began working with\r\nus in one of our offices first and then switched to remote later on. This early\r\nface-time with colleagues helped build strong relationships and absorb knowledge\r\nbefore switching to full-time remote.\r\n\r\n## The occasionally remote\r\nIt's not just the fully-remote who work outside the office. Any of the regular\r\noffice team can also opt to work from home. When someone is expecting a\r\ndelivery, has a medical appointment or needs to take their car to be serviced,\r\nit's fine to work remotely.\r\n\r\nWe also encourage anyone to work from home if they're starting to feel a bit\r\npoorly and not well enough to travel, but not too sick to work. Not only does\r\nthis help with recovery, it prevents the spread of early-stage germs to avoid\r\nothers being infected.\r\n\r\n## How we make it work\r\n**Chat**: Like many other development teams, we make heavy use of [Slack][]. We\r\nchat in `chatter`, discuss work in team channels and share things we've found in\r\nchannels like `newbie` and `ux`. It's the glue that binds everyone together,\r\nwhether co-located or remote.\r\n\r\n**Video**: Almost as vital is Google [Hangouts][gh] for video conversations. We\r\nuse a form of Scrum to organise our teams: every stand-up, sprint planning\r\nsession and retrospective involves a Hangout. The integration with Slack means\r\nanyone can kick off an ad-hoc video conversation from within a channel, alerting\r\nand bringing together the whole team. We sometimes also use [Screenhero][] for\r\nscreen sharing and collaboration.\r\n\r\n**Web tools**: Just like our company's [product][wld], the tools we use are\r\nweb-based, so can be accessed from anywhere. Source code is hosted on GitHub\r\nand we use its [Pull Requests][pr] to collaborate on features and code-review.\r\nStories are created and prioritised in [Jira][], mock-ups are reviewed in\r\n[InVision][] and our documentation written-up in [Confluence][]. Google's\r\n[GSuite][] handles our company email, calendars and office documents.\r\n\r\n**Equipment**: Almost everyone in the team uses a MacBook Pro with plenty of\r\nmemory plugged in to one or more big displays. And this includes remote workers.\r\nWe also provide external keyboards, trackpads, mice and any other peripherals to\r\nmake their environment comfortable and productive.\r\n\r\n**Management**: Line managers hold scheduled weekly 1:1s and regular appraisals\r\nwith remote people over Hangouts, in addition to ad-hoc daily chats over Slack.\r\n\r\n**Team**: For each and every team event we get together via a Hangout. Each\r\nMonday I run a 10-minute meeting updating the whole team on what's happening.\r\nWhen someone sadly leaves the team we gather for presents and goodbyes. Even our\r\nSecret Santa presents are sent in advance and then opened synchronously with\r\nremotes!\r\n\r\n**Company**: And don't forget company events and celebrations. For anything\r\ninvolving the wider company we set up a wide-angle camera and broadcast over a\r\nHangout. It's just as important to include remote people to hear from the CEO\r\nand other senior management.\r\n\r\n**Face-to-face**: Each month we invite the whole team (including remoters) to\r\nour head office in Windsor for our regular company meeting. There is often a\r\ncharitable or social element to the day, e.g. a pub quiz or sports day, and so\r\nthe team can mix with colleagues they wouldn't generally interact. We also\r\norganise team workshops or tech talks on the same day which are\r\nbroadcast/recorded for those unable to attend.\r\n\r\n## Remote benefits our people\r\nA common theme in feedback from our remote people was about their better\r\nwork-life balance, especially no longer requiring long commutes which \"drained\"\r\nthem and meant their only downtime was at weekends.\r\n\r\nWhile some people enjoy open-plan offices, others find working at home more\r\nproductive: \"I don’t miss loud phone calls and blaring radios from other\r\ndepartments\" and \"Fewer distractions and better focus for me.\"\r\n\r\nBeing remote hasn't damaged career prospects. Three of our team progressed to\r\nsenior positions after going fully remote. Appraisals are still conducted and\r\npromotions awarded regardless of location.\r\n\r\n## Remote benefits our company\r\n[Companies that support remote work have 25% lower employee turnover than\r\ncompanies that don't][owl]. We've retained several of our most experienced\r\npeople through embracing remote. By insisting individuals travel to our offices\r\nI don't believe that would have been possible.\r\n\r\nWe see fewer employee sick days: as one of our remoters commented, \"My health\r\nhas improved since going remote. Much less exposure to the communal germ pool.\"\r\n\r\nWhile it doesn't exactly qualify as \"[following the sun][fts]\", our two NZ\r\ndevelopers are online and available earlier in the day to help react to\r\nemergencies or catch up with overnight issues.\r\n\r\n## Challenges to overcome\r\n**Staying in the loop**: Where possible, we try to kick off ad-hoc Hangouts to\r\ndiscuss issues with everyone in the team instead of an in-office conversation.\r\nWe don't always get it right when fire-fighting and this can be a frustration\r\nfor those offsite.\r\n\r\n**Being ignored**: Our remote people say it can also be frustrating to ping\r\nsomeone on Slack when it's important and not get a response. \"You can't just go\r\nover and kick someone!\" We encourage team-based public channels rather than\r\nprivate channels or direct messages so that others can also jump in to help.\r\n\r\n**Culture**: With remote people, it's important to work even harder on company\r\nand team culture. This can be tough, but by reinforcing the attitude to always\r\nconsider remoters' needs in everything you do, the feeling of remoteness can be\r\nreduced.\r\n\r\n**Trust**: It's clearly essential that people that work remotely are trusted to\r\ndo so by their team and manager. Our approach has been to start off with a trial\r\nperiod working at home to allow both sides to feel comfortable and establish\r\nexpectations early on.\r\n\r\n**Pros and cons**: Inevitably some things can't be replicated through tools or\r\nprocess: \"I miss pub lunches and the pool table. Oh, and the coffee machine,\"\r\nbut, \"I find the convenience of working from home makes up for the loss of\r\nin-office benefits.\"\r\n\r\n## Tips and advice\r\nWhen chatting to our remote people I finished by asking them for their own tips\r\nand advice for making a success of working remotely. Here are their suggestions:\r\n\r\n> \"Work out a routine ahead of time and stick to it. Don’t work near a TV. And\r\n> you need a good chair. Also remember to take a lunch break away from the\r\n> computer.\"\r\n\r\n> \"It's important to have a quiet space free from distractions. Especially if\r\n> you have children. And having the right equipment helps too (e.g. big\r\n> monitor).\"\r\n\r\n> \"I think getting out of the house before or after work or at lunch time for\r\n> some exercise is important.\"\r\n\r\n> \"I tend to take small breaks from the screen to grab a drink and talk to the\r\n> guinea pigs. So maybe all remoters should have guinea pigs.\"\r\n\r\n\r\n[owl]: https://www.owllabs.com/state-of-remote-work\r\n[slack]: https://slack.com\r\n[gh]: https://hangouts.google.com/\r\n[fts]: https://en.wikipedia.org/wiki/Follow-the-sun\r\n[pr]: https://help.github.com/articles/about-pull-requests/\r\n[jira]: https://www.atlassian.com/software/jira\r\n[confluence]: https://www.atlassian.com/software/confluence\r\n[invision]: https://www.invisionapp.com\r\n[gsuite]: https://gsuite.google.com\r\n[venntro]: https://www.venntro.com\r\n[devteam]: http://dev.venntro.com\r\n[wld]: http://www.whitelabeldating.com\r\n[screenhero]: https://screenhero.com\r\n"
    ],
    "category": [
      "remote",
      "work",
      "venntrodev"
    ],
    "entry-type": [
      "note"
    ],
    "published": [
      "2017-10-18T09:12:21Z"
    ]
  }
}