{
  "type": [
    "h-cite"
  ],
  "properties": {
    "url": [
      "https://martymcgui.re/2017/05/08/150527/"
    ],
    "name": [
      "Site-Updates: Easier POSSE with Micropub Edits!"
    ],
    "published": [
      "2017-05-08T19:05:27Z"
    ],
    "content": [
      {
        "html": "<p>\n  <i><a href=\"https://jonathanprozzi.net/\">Jonathan Prozzi</a> and I have challenged one another to make a post about improving our websites once a week. This one should have gone up last week!</i>\n  <br>\n</p>\n<p>A few weeks ago I posted some thoughts about <a href=\"https://indieweb.org/User:Martymcgui.re#My_IndieWeb_Setup\">my IndieWeb setup</a> called \"<a href=\"https://martymcgui.re/2017/04/19/151612/\">Easier POSSE with Micropub Edits?</a>\" in which I wished for a tool that would let me take a given post from my site, syndicate it to silos like Twitter and Facebook (tweaking the content if I want), and updating the post on my site to show the links to those syndicated copies.</p>\n<h3>Why?</h3>\n<p>I failed to make at least one important thing clear in my original post – why do I care about syndication links? There are many reasons.</p>\n<ul>\n  <li>I have set up a <a href=\"https://martymcgui.re/2017/03/29/161441/\">system to notify me when my posts get webmentions from other sites</a>.</li>\n  <li>\n    <a href=\"https://brid.gy/\">Brid.gy</a> will <a href=\"https://indieweb.org/backfeed\">backfeed</a> comments and reactions from sites like Twitter and Facebook to my site via webmention, but <a href=\"https://brid.gy/about#link\">only if brid.gy knows which posts on those silos correspond to a post on my site</a>.\n    <br>\n  </li>\n</ul>\n<p>If I decide that a post should be syndicated to a silo, it's because I want it to reach the people who follow me there and, if that is true, I also want their interactions to come back to my site. So, in these ways, a post isn't \"done\" unless it is on my site, with syndicated copies on the silos I care about, and with syndication links for brid.gy to feed the interactions back.</p>\n<h3>Starting at the End</h3>\n<p>I decided to start by making my site's Micropub server support <a href=\"https://www.w3.org/TR/micropub/#source-content\">Micropub Source Content Queries</a> and <a href=\"https://www.w3.org/TR/micropub/#update\">Micropub Updates</a>. Any tool that helped automate syndication would need this plumbing to operate.</p>\n<p>When implementing a new feature, it always helps to have something to test against. So, I went looking for a Micropub <b>client</b> which supported queries and edits. The test suite for Micropub at micropub.rocks includes a lovely <a href=\"https://micropub.rocks/implementation-reports/clients/\">implementation report grid</a>, showing which Micropub clients support what features of the spec.</p>\n<p>Of the clients listed, two of them were web-based and Open Source. I had played with and liked <a href=\"https://inklings.io/inkstone/\">Inkstone</a> in the past, but its edit features are currently considered a work-in-progress. So, I tried out <a href=\"https://micropublish.net/\">Micropublish.net</a>, and it was exactly what I was looking for.</p>\n<p>Micropublish has a feature to let you enter a URL for a post on your site to edit. It will use Micropub source content queries to get the source data for that post and let you edit the content and other properties of the post. It can then send a Micropub update to save the updated version of the post back to your site, if your server supports updates. It even has a great feature for developers - a \"Preview\" button will show you exactly what request will be sent to your server for the update.</p>\n<figure>\n  <img src=\"https://media.martymcgui.re/f9/c2/b1/cb/ba7349e148b0317eb85be5c0275f5b9d1428907a31851bf39b345118.png\" alt=\"\">\n  <figcaption>Screenshot of micropublish.net preview for an update to add a syndication link to a post</figcaption>\n</figure>\n<p>Micropublish.net is a great tool for testing out Micropub query and update support, but my Micropub server is bespoke, hastily-written, hand-rolled Python. So, while it was easy enough to add query support, it took me a while to get my code structure cleaned up, write some tests, and actually implement updates.</p>\n<h3>A New Workflow</h3>\n<p>I am pleased to say that it works and, with the help of Micropublish.net, I now have a functioning workflow for publishing to my site and syndicating to silos like Twitter and Facebook, even from my phone, without having to open my laptop, edit YAML data, and push git repositories around. It looks like this.</p>\n<ul>\n  <li>\n    Make a new post to my site with a micropub client like <a href=\"https://quill.p3k.io/\">Quill</a>.\n    <br>\n  </li>\n  <li>Open the post for editing in micropublish.net (I use Url Forwarder for Android to make this super easy on my phone, a bookmarklet makes it easy on my laptop).</li>\n  <li>\n    In a new tab, log in to Twitter and make a similar post, copy the URL to the new tweet into the Syndication field on my post.\n    <br>\n  </li>\n  <li>Repeat the steps to make posts on Facebook, Mastodon, etc., copying their URLs into the Syndication field.</li>\n  <li>\n    Finally, hit \"Update\" in micropublish.net to update my post with the syndication links.\n    <br>\n  </li>\n</ul>\n<figure>\n  <img src=\"https://media.martymcgui.re/70/ed/84/78/0723d7a27cc5cacff92adbf0a8d19b902cf7598132f25023a74c532b.png\" alt=\"\">\n  <figcaption>Screenshot of micropublish.net with new syndication links</figcaption>\n</figure>\n<p>This is still a very manual process, but it now makes it <b>possible</b> to <b>finish</b> a post in a way that I couldn't before. In the spirit of <a href=\"https://indieweb.org/manual_until_it_hurts\">manual until it hurts</a>, I will use this for a while and see what existing pain points remain, and what new ones appear, to help decide what comes next.</p>\n<p>Thanks to <a href=\"https://barryfrost.com/\">Barry Frost</a> for micropublish.net and to <a href=\"http://tantek.com/\">Tantek</a> for the nudge to write an update!</p>\n\n    \n    \n      \n      \n\n\n\n\n<div class=\"row\" style=\"margin-bottom: 1em\"><div class=\"col-xs-12\">\n  <h4>Likes</h4>\n  <div class=\"facepile\">\n    \n      \n      \n      \n      \n      <div class=\"face p-like h-cite\">\n        <a class=\"u-url\" href=\"https://aaronparecki.com/2017/05/08/8/\"><span class=\"p-author h-card\"><img class=\"u-photo\" src=\"https://martymcgui.re/imageproxy/60,syh8BWUGt473NSTN37qILs31gY7Dut-81OtZgAWjB9VU=/https://webmention.io/avatar/aaronparecki.com/2b8e1668dcd9cfa6a170b3724df740695f73a15c2a825962fd0a0967ec11ecdc.jpeg\" alt=\"Aaron Parecki\" title=\"Aaron Parecki\"></span></a>\n      </div>\n    \n  </div>\n</div></div>"
      }
    ],
    "author": [
      "https://martymcgui.re/"
    ]
  }
}