{
  "type": [
    "h-cite"
  ],
  "properties": {
    "url": [
      "https://colinwalker.blog/2017/11/12/learning-from-the-past/"
    ],
    "name": [
      "Learning from the past"
    ],
    "published": [
      "2017-11-12T16:51:36Z"
    ],
    "content": [
      "There was a quick conversation on micro.blog about RSS triggered by a post from Jason Dettbarn which, in turn, was in response to David Sparks' \"The case for RSS.\"\nThe upshot was that Google Reader was both the standard bearer and pall bearer for RSS at the same time.\nJames mentioned the ability of large companies to usurp tech like Google did with RSS and asked could it happen again with the #indieweb?\nAs I’ve written before, webmentions are the glue that binds the indieweb together, connecting sites from across the web by way of comments, likes, replies etc. They are detailed in a W3C recommendation well on its way to becoming a full, recognised standard - but then so was RSS.\nGoogle cornered the RSS market and Reader became synonymous with RSS; everyone designed their feeds to best fit it, just as everyone tweaks their SEO to please Google search largely ignoring other search engines.\nBut Google Reader demanded certain things. Every post needed a title, for example, and the rest of the RSS ecosystem followed. It became the de facto standard for RSS, effectively pushing everyone else out.\nThe rise in popularity of social media as a news source meant many were already declaring that RSS was done but Reader's closure sounded the death knell and left a massive vacuum when Google decided to concentrate on Google Plus.\nThat synonymity between service and standard meant the closure of one symbolised the demise of the other but standards only \"die\" when they are superseded by something else, something better. While using social streams as news delivery mechanisms certainly became de rigueur, and the real time nature of Twitter is admittedly unsurpassed, this cannot be seen as sufficiently better to kill off a standard.\nSo, what of the indieweb and webmentions?\nI previously argued that wider indieweb adoption would probably happen by stealth rather than being actively sought out by average users.\n\n\"What if, for example, Automattic (the company behind WordPress) suddenly decided that all standard WordPress.com themes were going to include microformats2 markup and support webmentions? You've instantly got millions of people with an indieweb presence who haven't got a clue what it is or how it works, just that things are a little different.\"\n\nThe WordPress community currently seems reluctant to entertain the idea of indieweb integration but what would happen if such a major player did enter the arena and started to impose its own requirements just as Google did with RSS?\nThe sudden injection of millions of indieweb properties would likely cause a further rush of adoption as others seek to implement a technology which they feel would generate exposure and engagement.\nSuch adoption, however, would not be against the recognised standard but in line with the custom requirements imposed above to (selfishly) ensure maximum compatibility rather than compliance.\nJames' fear of a big tech company usurping an open platform could be realised and this custom implementation may become synonymous with the technology itself.\nTo take this to its logical conclusion, what would happen if after a few years the major player suddenly decided to ditch indieweb technologies in favour of the next big thing?\nWhere would that leave everyone?\nThose who relied directly on the platform dropping support would obviously be affected until an alternative became available. In the case of something like WordPress this would obviously be via plugins.\nBut, the advantage this has over the RSS issue, even with a major player dropping support, is the very nature of the indieweb itself.\nWhen Google Reader closed people had to actively seek an alternative in order to continue consuming their RSS feeds. This pushed many towards simply using their social streams - they couldn’t be bothered to find an equivalent service and re-add all their feeds.\nNo such need would exist with something like webmentions. People may not be able to immediately interact with as many properties but things wouldn’t stop working for those not hosted on the major player’s platform.\nSites interact directly with each other without the need for any central agency. If everyone had decided to adopt a custom implementation it would still work between all those sites that used it.\nThe very fact the technology would have been deployed across many different platforms means it couldn’t contain any showstopping proprietary requirements even if it did not adhere strictly to the original standard.\nThe overall impact would be significantly reduced."
    ],
    "author": [
      "https://colinwalker.blog"
    ]
  }
}