{
  "type": [
    "h-cite"
  ],
  "properties": {
    "url": [
      "http://altplatform.org/2017/07/28/an-introduction-to-the-indieweb/"
    ],
    "name": [
      "An Introduction to the IndieWeb"
    ],
    "published": [
      "2017-07-28T09:00:27Z"
    ],
    "content": [
      "There’s a better way to own and control your online identity\nWhy IndieWeb?\nWhether you’re starting a blog, building your personal brand, posting a resume, promoting a hobby, writing a personal journal, creating an online commonplace book, sharing photos or content with friends, family, or colleagues, writing reviews, sharing recipes, podcasting, or any one of the thousand other things people do online it all starts with having a presence and an identity online.\nThe seemingly difficult task these days is deciding where that should be. There’s Twitter for sharing short updates and bookmarks to articles; Instagram, Snapchat, Flickr, and YouTube for photos and videos; Facebook for communicating with family and friends; LinkedIn for work and career related posts; Swarm for sharing your location; and literally thousands of others for nearly every micro-slice of content one could think of.\nCan you possibly be on them all? Should you? Would you want to be? Could you keep up with it? Which one really and truly represents the real you? Could any of them?\nAnd what about your friends, family, and potential audience for all of these things? Some will be on Twitter while others only use Facebook. Grandma is worried about privacy and is only on Instagram to see photos of the grandchildren. Mom is on Facebook because she thinks that’s what the internet is, and wants to like everything her children post. Teenagers don’t want to be on any platforms their parents have heard of. It’s obvious that everyone has their own preferences and favorites.\nIn short, the web and using it for easy communication has become fraught with fragmentation and walls that often make communicating online far more difficult than it should be. Wouldn’t it be better if you had a single website that represented you online and through which you could easily communicate with everyone?\nBy analogy consider the telephone system which, just like the internet, consists of wires and hardware to access the network. Every user on the network has their own phone and phone number. What would it be like if AT&T users could only speak to other AT&T users and needed another separate phone, account, and phone number to speak to friends and family on Verizon and yet another to talk to friends on Sprint? To a great extent, this is what the internet has evolved to become with monopolistic, for-profit, corporate services like Facebook/Instagram, Twitter, LinkedIn, and all the rest.\nIs there a better and more robust solution than these multitudes of social media sites which all come with their own onerous terms of service, limitations on your creativity, reach, ownership, and control of your online identity?\nA growing number of people on the web are sure there is and they’re working together in an open yet coordinated way to improve the democratized nature of the decentralized internet. This movement is known as the IndieWeb.\nPurpose of IndieWeb\nThe purpose of the IndieWeb movement is to help put you in control of your web presence, allow you a more true sense of ownership of your content, and to allow you to be better connected to your friends, family, colleagues, and communities. By first owning your own domain name and having your own personal website, the IndieWeb aims to help facilitate the following:\nYou are in Control\nYou can post anything you want, in any format you want, with no one monitoring you. In addition, you share simple readable links such as http://www.example.com/ideas. These links are permanent and will always work.\nControl and Freedom\nYou should be able to exercise your freedom of speech and publish anything you want whenever you want. You should be able to set your own rules and own limits. You should be able to post content as long or short as you like with no pre-imposed limits or types whether it be text, photos, audio, or video. You should be able to have control over comments and protection against potential harassment, bullying, and online trolls.\nIdentity & Identity loss\nAlmost every social media site has a multi-page statement of their terms of service written in complicated legalese. More often that not, these terms are to protect them and not you. As a result people have found their accounts frozen, they’ve been shut out with no notice or warning, their identities have been reassigned, or their content simply disappears with liitle or even no notice. Often there is either no method of recourse, or it is difficult to communicate with these corporations and may take weeks or worse to recover one’s account and data, if at all.\nWithout care, one can become branded with the identity of the social media network of which they’re a part. If trolls overrun your social service then suddenly by association, you’ve become one too.\nUser Interface/User EXperience\nYou should have the ability to control how your site looks and works. Do you want a piece of functionality that one of your social network sites doesn’t have? Add it the way you want it. Create better navigation, better interactivity, better design to reflect your own identity instead of a corporation’s cookie-cutter idea of your identity. Since your data is yours you can add new and interesting pieces of functionality using that data instead of waiting on a social site to think about it and implement it for you. Chances are that unless millions will find it valuable or a company doesn’t think it will scale, most won’t build it, so don’t hold your breath.\nYour content is yours\nWhen you post something on the web, it should belong to you, not a corporation. Too many companies have gone out of business and lost all of their users’ data. By joining the IndieWeb, your content stays yours and in your control.\nGreater reliability and protection against content loss\nSocial media is only about 11 years old, and one thing is certainly true: sites will go out of business, they will get acquired, they can and will disappear. When this happens, your data can disappear overnight without the ability to back it up or export it. A new corporation can take over and change the terms of service and do things with your data that you never intended. Content can accidentally or even willfully disappear without notice to you. In addition to the data, you can also lose contact with family, friends, and community members that also disappear without the service that connected you to them.\nYou can have greater control of site downtimes, server outages, maintenance, scalability issues, and database failures of silos attempting to solve massive scaling/engineering problems.\nA better sense of ownership\nMany in the IndieWeb community have found that they post more interesting and thoughtful pieces of content when they’re doing it on their own site rather than the “throw away” content they used to post to sites like Twitter. They feel a greater sense of responsibility and ownership in what they’re posting about and this can have a profound effect on the future of the internet and its level of civility.\nAuthor centric\nWhen you own your own website, other web sites see that it’s you personally sending traffic to their sites instead of a generic social site. You have the ability to edit content at any time or delete it if you like.\nYou also have:\n\ngreater choice of public vs. private posts and control of who your audience is;\nthe ability to fix URL links when they break or disappear;\nno outside advertising on your site without your explicit permission;\nno one monetizing you;\nno censorship of your content;\nno terms of service which can often co-op your work without notice for advertising or other use;\nownership and control of affiliate links to monetize your work if you choose.\n\n You are better connected\nYour articles and status messages can go to all services, not just one, allowing you to engage with everyone regardless of their choice of platform. Even replies and likes on other services can come back to your site so they’re all in one place.\nSince your content isn’t hidden behind the robots.txt of a silo service, you have much better search engine rankings and are more likely to be found, read, or have people interact with your content. If you choose, you can still syndicate your content to one or more social silos while still owning your content in the case that something happens to those silos. This allows you to continue to reach your friends, family, colleagues, and community who may have different ideas about where they prefer to interact online. Comments to and interactions with your content can come back to your original post to create a comprehensive conversation rather than have your conversation disjointed and spread over dozens of sites throughout the web.\nHow to be a part of the IndieWeb\nNow that you’ve got a bit of an idea about what the IndieWeb movement is attempting to help people accomplish, how can you become a part of it and enjoy the benefits for yourself?\nOwn and use your own domain name\nFifteen or more years ago having your own domain wasn’t as easy or as inexpensive as it is now. There are hundreds and hundreds of domain registrars around the world that can register almost any domain name you can come up with for as little as 99 cents a year with the average closer to the $10-20 range depending on the name and the top level domain (.com, .org, .net, and .edu are examples of top level domains.)\nFor an extra $0-10 a month you can quickly purchase domain hosting so that when someone visits your fancy URL, it actually connects to a page on the internet. Whether that page is a single page of simple HTML with a line of text and a photo; a plug and play site like Wix or SquareSpace; a full blown professional open source content management system like WordPress or Drupal; a web site you build by hand using your own code; or it points to your Facebook or Twitter account page, you’ve just made a huge step toward better cementing your identity on the internet.\nOnce you own your own domain name, everything you post to the web will have a permalink URL which you can control. If you wish to change platforms or service providers you can relatively easily move all of your content and the permalinks along with it–much the same way you can move your cell phone number from one provider to another. People who visit your URLs will always be able to find you and your content.\n\nTwitter account profile asking for your name, bio, location, and your personal domain name/URL online.\n\nIf nothing else, owning your own domain name will give you something useful to put into the ubiquitous field labeled “your website” that exists on literally every social media website out there. (Even they are subtly telling you that you should have your own domain name.)\nAdded bonus: even most inexpensive domain registrars and hosting services will give you free email for your domain so you can create a custom branded personal email address like susan@yourname.com. Even if you rely on G-mail or some other third party service for your email, it’s pretty easy to connect your own personal email address to your pre-existing account. It’ll make you look a lot more professional and will be far easier for your friends, family, and business colleagues to remember.\nSo you own your domain now?! Congratulations, you are officially a full-fledged member of the IndieWeb!\nOwn your data\nWait, it can’t be that simple can it? It is! But now that you’ve got your own website, it’s time to start using it to own your online identity and own your own content.\nNext you may want to choose a content management system (CMS) in which to store and present your data. The IndieWeb has lists of projects which range from common services as simple as Tumblr and WordPress.com (both managed services with free hosting) to help in building your own site from the ground up in your programming language of choice. Which project you choose depends on your needs, desires for the future, and your abilities. There is something available for people of nearly every level of ability. Most domain registrars and internet host providers provide one or more means to quickly get up and running–just ask their customer service departments or see what they’ve got available online.\nMost of these CMS solutions will give people a far bigger range of flexibility in terms of what they can write, record, and broadcast online. You don’t need to be limited to 140 characters if you choose not to be. Want to post more multi-media-based content with text, video, audio, and photos all at once? The online world can be your oyster and your social media platform no longer limits what is possible.\nFurther Steps\nIdeally, what a lot of the IndieWeb developer community is rapidly building and iterating upon is an open and broadly distributeable way to make it easier for the everyday person to more easily own and operate all the functionality offered by the hundreds of social media websites without a lot of heavy and difficult-to-maintain overhead. A decade ago allowing Facebook to do everything for you may have been a simple “way out”, but now there are far more robust, diverse, and flexible solutions that aren’t as onerous. There are also newer open and easily supportable web protocols that make publishing and sharing your content far easier than before.\nThe first big piece most people enjoy implementing is writing their own content on their own site and syndicating it out to other services on the internet if they choose. Continuing to participate in your old siloed networks can help you stay connected to your pre-existing social networks, so you’re not leaving all your friends and family behind. Next, having all your replies/comments, likes, and other interactions come back from social silos to your own site as comments along with notifications is incredibly valuable. (These two processes are commonly known as Post On your Own Site, Syndicate Elsewhere (POSSE) and backfeed, and they can typically be done most easily with a free service like Brid.gy.)\nBeing able to write replies to articles or status updates on your own website and either @mentioning others as a means of notifying them is also very useful. The IndieWeb calls this universal implementation of @mentions that work across website boundaries Webmention and it’s built on an open and straightforward standard so that it can work with any website on the internet. (Remember the telephone analogy above? Now, thanks to Webmentions, everyone can be communicating on the same network.) As an example, imagine for a moment if you could @mention someone on Facebook from Twitter or vice-versa?! What if you could post a reply to a tweet on Twitter with your Facebook account?Using the Webmention spec, independent websites can easily do this now, though it may be quite a while before for-profit corporations support this simple protocol that is now a W3C recommendation.\nWith some of the basic building blocks out of the way, people tend to spread out a bit in the types of functionalities they’re looking for.  It may range from posting status updates, pictures, or video to hosting your own podcast or  or having different user interfaces to post to your own site–Micropub is great for this–to being able to put events on your site and allowing people to RSVP to them easily. Wouldn’t it be nice if you could post an event on your own website and people could use Facebook to RSVP to it? My site allows this possibility. Yours could too.\nEveryone’s desires and needs will be different. Work on what you find most interesting and useful first (the IndieWeb calls these itches). Make a list of what you use most often on your old social media silos or wish they had and work on that first. Check out the IndieWeb wiki to see how others have implemented it–there’s no need to reinvent the wheel in darkness. Hop into the IndieWeb chat (there are multiple ways of doing this and interacting) and ask questions. Document what you’ve done in the wiki to make it easier for those who come after you.\nPersonally, I’ve always just thought about what functions do I use most on social sites and then ask myself how I might be able to do that on my own site. There’s little out there that hasn’t been explored by the bigger community, so searching the wiki for those types of functionality and seeing how others managed it usually makes it far easier. Chatting with folks in the community while I’m working always helps to sharpen my thinking and make me aware of ideas and methods I may have never considered much less come up with on my own.\nIf you never RSVP for things online or host events, then obviously don’t start there. Do you post photos regularly? Maybe you “like” everything you see online. In my case, I was a heavy user of Goodreads, so I spent parts of the last year working on more easily bookmarking things I’d like to read, posting reading status updates, and keeping notes on what I read, as well as highlights, marginalia, and book reviews after I’d finished reading.\nGuiding Philosophy\nThe IndieWeb effort is different in several ways from previous efforts and communities. In particular it values principles over project-centrism. Other efforts have assumed a monoculture of one project as the ultimate solution for everyone. IndieWeb prefers developing a plurality of projects–why not have the same diversity on the web as we do in real life?\nThe community prefers chat in combination with a wiki to communicate and document its process. Some may prefer email distribution lists, but why? Who likes to read and respond to long email threads where information is typically locked away from the group, ignored, and simply unread? Instead, we utilize a chat (which has multiple methods of access–plurality, remember?) to host searchable conversations after which the best portions are documented on the wiki to be easily searchable and discoverable to all.\nIn the early days of social media, many talked, emailed and chatted about what they’d like to see. Sadly not much was done about expanding on these ideas, particularly by companies that all had their own profit-driven motives. As a result, the IndieWeb movement values showing before telling. They prioritize development by encouraging people to scratch their own itches, creating what they want to have and use on their own sites, and then iterating on those pieces to improve and refine them. If you won’t use a feature on your own site, why bother to have it?\nIndieWeb puts design first and foremost. Protocols & formats come second. They’d prefer to focus on good user experience and user interaction. Users selfdogfood prototypes on their own sites to create minimum necessary formats & protocols.\nPerhaps most importantly, the IndieWeb is people-focused instead of project-focused. The community is rich and diverse and has regular in-person meetups as well as camps across the world where everyone is welcome. The IndieWeb community is inclusive and has a code-of-conduct.\nJoin the IndieWeb Community\nWhere do I go from here? You said community in there. Where can I find it? How can I interact, get help, or even contribute back?\nRegardless of your level of expertise, there are a huge number of resources, events, and even people available to you in a variety of formats. Whether you choose to meet with friends in person at IndieWebCamps or at regularly scheduled Homebrew Website Club meetups or interact online at a nearly continuous worldwide chat (using either web chat, Slack, Matrix, or IRC) there are many means of getting help and interacting to suit your schedule and needs to help build the personal website you’ve always wanted.\nBuilding the indie web is a continuous process. While attending an IndieWebCamp can be an incredibly inspiring and encouraging event, we need to carry on doing so for more than just a few days a year when we can meet up in real life. We can not only support one another; we can share the best way to do things online. As we discover new ways of doing things, we can document them and share them easily with each other and the growing community.\nIf you’ve made it this far, I invite you to join us, and get started building the internet you’ve always wanted by building your home on the web first.\n\nShare this:\n\nClick to share on Twitter (Opens in new window)\nClick to share on Facebook (Opens in new window)\nClick to share on LinkedIn (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to share on Google+ (Opens in new window)\nClick to email this to a friend (Opens in new window)\nClick to print (Opens in new window)\n\n\n\n\nLike this:\n\nLike Loading...\n\n\n\n\n\tRelated"
    ],
    "author": [
      "http://altplatform.org/author/chrisaldrich/"
    ]
  }
}